# MSc Artificial Intelligence Python Primer
# Unit 7 Jupyter Notebook 
# Introduction to Pandas


## Goals
This notebook has been created to familiarise you with the Pandas package. Most of the code needed to progress through this Notebook has been provided for you. However, there are several coding tasks that you will need to complete yourself by entering code yourself.

The topics in this notebook include:
* Pandas ``Series``, ``DataFrame`` and ``Index`` data structures
* File
* Indexing and Selection
* Handling missing data
* Combining Datasets
* Aggregation and Grouping
* Vectorised String Operations
* Working with Time Series data

## Data Manipulation with Pandas

In Unit 6, we focused on NumPy arrays (also known as `ndarrays`), which provide efficient storage and manipulation of dense typed arrays in Python. This unit builds on this knowledge by looking in detail at the data structures provided by the Pandas library. Pandas is a newer package built on top of NumPy, and provides an efficient implementation of a ``DataFrame``.
``DataFrame``s are essentially multidimensional arrays with attached row and column labels, and often with heterogeneous types and/or missing data. As well as offering a convenient storage interface for labeled data, Pandas implements a number of powerful data operations familiar to users of both database frameworks and spreadsheet programs.

## Introducing Pandas Objects

At the very basic level, Pandas objects can be thought of as enhanced versions of NumPy structured arrays in which the rows and columns are identified with labels rather than simple integer indices. Pandas provides a host of useful tools, methods, and functionality on top of the basic data structures, but nearly everything that follows will require an understanding of what these structures are. There are three fundamental Pandas data structures: the ``Series``, ``DataFrame``, and ``Index``.

The Pandas library is available in the Anaconda installation and so you simply need to import the package to access its tools and capabilities. By convention, you'll find that most people in the data science world will import Pandas using ``pd`` as an alias.

In [1]:
import pandas as pd

### The Pandas Series Object
A Pandas ``Series`` is a one-dimensional array of indexed data. It can be created from a List, Dictionary or NumPy Array. A ``Series`` has no column labels - it is just a single column of a DataFrame. However, a ``Series`` does have row labels.

In [2]:
data = pd.Series([0.25, 0.5, 0.75, 1.0])
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

Like with a NumPy array, data can be accessed by the associated index via the familiar Python square-bracket notation:

In [3]:
data[1]

0.5

Or an array slice:

In [4]:
data[1:3]

1    0.50
2    0.75
dtype: float64

However, the Pandas ``Series`` is much more flexible than the one-dimensional NumPy array that it emulates. The essential difference between a ``Series`` object and a NumPy Array is the presence of the index. While the Numpy Array has an *implicitly defined* integer index used to access the values, the Pandas ``Series`` has an *explicitly defined* index associated with the values. This explicit index definition gives the ``Series`` object additional capabilities. For example, the index need not be an integer, but can consist of values of any desired type.

In [5]:
data = pd.Series([0.25, 0.5, 0.75, 1.0],
                 index=['a', 'b', 'c', 'd'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

And the item access works as expected:

In [6]:
data['b']

0.5

Or we could construct a ``Series`` object directly from a Python Dictionary:

In [7]:
population_dict = {'California': 38332521,
                   'Texas': 26448193,
                   'New York': 19651127,
                   'Florida': 19552860,
                   'Illinois': 12882135}
population = pd.Series(population_dict)
population

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

By default, a ``Series`` will be created where the index is drawn from the sorted keys.
From here, typical dictionary-style item access can be performed:

In [8]:
population['California']

38332521

Unlike a dictionary, though, the ``Series`` also supports array-style operations such as slicing:

In [9]:
population['New York':'Illinois']

New York    19651127
Florida     19552860
Illinois    12882135
dtype: int64

### The Pandas DataFrame Object

Like the ``Series`` object discussed in the previous section, the ``DataFrame`` can be thought of either as a generalization of a NumPy array, or as a specialization of a Python dictionary. It is a 2-dimensional data structure that can store data of different types (including characters, integers, floating point values, categorical data and more) in columns. It is similar to a spreadsheet, a SQL table or the data.frame in R.

If a ``Series`` is an analog of a one-dimensional array with flexible indices, a ``DataFrame`` is an analog of a two-dimensional array with both flexible row indices and flexible column names. To illustrate, let's construct a new ``Series`` listing the area of each of the five states discussed in the previous section:

In [10]:
area_dict = {'California': 423967, 'Texas': 695662, 'New York': 141297,
             'Florida': 170312, 'Illinois': 149995}
area = pd.Series(area_dict)
area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
dtype: int64

We can now combine the ``area`` Series with the ``population`` Series to construct a single two-dimensional object containing this information:

In [11]:
states = pd.DataFrame({'population': population,
                       'area': area})
states

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

Similarly, we can also think of a ``DataFrame`` as a specialization of a dictionary. Where a dictionary maps a key to a value, a ``DataFrame`` maps a column name to a ``Series`` of column data. For example, asking for the ``'area'`` attribute returns the ``Series`` object containing the areas we saw earlier:

In [12]:
states['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

Another approach to create a `DataFrame` from tabular data is to use a Dictionary of Lists (or NumPy Arrays). The following example uses the same information as the examples above. When using this approach we also need to explicitly define the index values using the `index` parameter.

In [13]:
data={'population':[38332521,26448193,19651127,19552860,12882135],
      'area':[423967,695662,141297,170312,149995]}
states = pd.DataFrame(data, index=['California','Texas','New York','Florida','Illinois'])
states

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

### The Pandas Index Object

We have seen here that both the ``Series`` and ``DataFrame`` objects contain an explicit *index* that lets you reference and modify data. This ``Index`` object can be thought of as an *immutable array* or as an *ordered set*. As a simple example, let's construct an ``Index`` from a list of integers:

In [14]:
ind = pd.Index([2, 3, 5, 7, 11])
ind

Int64Index([2, 3, 5, 7, 11], dtype='int64')

#### Index as immutable array

The ``Index`` in many ways operates like an array.
For example, we can use standard Python indexing notation to retrieve values or slices:

In [15]:
type(ind)

pandas.core.indexes.numeric.Int64Index

In [16]:
ind[1]

3

In [17]:
ind[:2]

Int64Index([2, 3], dtype='int64')

One difference between ``Index`` objects and NumPy arrays is that indices are immutable–that is, they cannot be modified via the normal means:

In [18]:
# ind[1] = 0

This immutability makes it safer to share indices between multiple ``DataFrame``s and arrays, without the potential for side effects from inadvertent index modification.

#### Index as ordered set

Pandas objects are designed to facilitate operations such as joins across datasets, which depend on many aspects of set arithmetic.
The ``Index`` object follows many of the conventions used by Python's built-in ``set`` data structure, so that unions, intersections, differences, and other combinations can be computed in a familiar way:

In [19]:
indA = pd.Index([1, 3, 5, 7, 9])
indB = pd.Index([2, 3, 5, 7, 11])

In [20]:
indA & indB  # intersection

C:\Users\h22-liu\AppData\Local\Temp\ipykernel_30576\76773435.py:1: FutureWarning: Index.__and__ operating as a set operation is deprecated, in the future this will be a logical operation matching Series.__and__.  Use index.intersection(other) instead.
  indA & indB  # intersection

Int64Index([3, 5, 7], dtype='int64')

In [21]:
indA | indB  # union

C:\Users\h22-liu\AppData\Local\Temp\ipykernel_30576\2015131817.py:1: FutureWarning: Index.__or__ operating as a set operation is deprecated, in the future this will be a logical operation matching Series.__or__.  Use index.union(other) instead.
  indA | indB  # union

Int64Index([1, 2, 3, 5, 7, 9, 11], dtype='int64')

In [22]:
indA ^ indB  # symmetric difference

C:\Users\h22-liu\AppData\Local\Temp\ipykernel_30576\1234474844.py:1: FutureWarning: Index.__xor__ operating as a set operation is deprecated, in the future this will be a logical operation matching Series.__xor__.  Use index.symmetric_difference(other) instead.
  indA ^ indB  # symmetric difference

Int64Index([1, 2, 9, 11], dtype='int64')

### <font color='red'><u>Worksheet Exercises</u></font>
1. Using an appropriate NumPy function, create a ``Series`` object with 40 equally space values between 0 and 10 (i.e. every 0.25)
2. The following table shows the percentage frequency of online purchases in 2020 by men. Create a ``Series`` object to represent the data shown in the following table:

| index | value |
|---|---|
|  once or twice | 18 |
| three to five times | 28 |
| six to ten times | 20 |
| eleven times or more | 34 |

3. The following Python `Dictionary` definition includes the frequency of online purchases in 2020 by women: `{'once or twice': 15, 'three to five times': 32, 'six to ten times': 18,'eleven times or more': 34}`. Use this `Dictionary` to create a second ``Series`` object 
4. Now, combine the two ``Series`` from 2. and 3. above to create a new ``DataFrame`` object.
5. The following table shows the percentage frequency of online purchases in 2020 by age group. Create a ``DataFrame`` object to represent this data.

|  | 16-24 | 25-34 | 35-44 | 45-54 | 55-64 | 65+ |
|---|---|---|---|---|---|---|
| once or twice | 25 | 11 | 12 | 9 | 19 | 26 |
| three to five times | 30 | 26 | 23 | 36 | 25 | 39 |
| six to ten times | 20 | 18 | 20 | 17 | 22 | 19 |
| eleven times or more | 24 | 43 | 44 | 37| 34 | 15 |

In [23]:
import numpy as np
import pandas as pd

# 1.
pd.Series(np.arange(0,10,0.25))

print("-------------------------------------------------")

# 2.
men = pd.Series([18,28,20,34], index=['once or twice', 'three to five times', 'six to ten times', 'eleven times or more'])
print(men)

print("-------------------------------------------------")

# 3.
women = pd.Series({'once or twice': 15, 'three to five times': 32, 'six to ten times': 18,'eleven times or more': 34})
print(women)

print("-------------------------------------------------")

# 4.
gender_purchase = pd.DataFrame({'male':men, 'female': women})
print(gender_purchase)

print("-------------------------------------------------")

# 5. 
data={'16-24':[25,30,20,24],
      '25-34':[11,26,18,43],
      '35-44':[12,23,20,44],
      '45-54':[ 9,36,17,37],
      '55-64':[19,25,22,34],
        '65+':[26,39,19,15]}
age_group_purchase = pd.DataFrame(data, index=['once or twice', 'three to five times', 'six to ten times', 'eleven times or more'])
print(age_group_purchase)

print("-------------------------------------------------")

-------------------------------------------------
once or twice           18
three to five times     28
six to ten times        20
eleven times or more    34
dtype: int64
-------------------------------------------------
once or twice           15
three to five times     32
six to ten times        18
eleven times or more    34
dtype: int64
-------------------------------------------------
                      male  female
once or twice           18      15
three to five times     28      32
six to ten times        20      18
eleven times or more    34      34
-------------------------------------------------
                      16-24  25-34  35-44  45-54  55-64  65+
once or twice            25     11     12      9     19   26
three to five times      30     26     23     36     25   39
six to ten times         20     18     20     17     22   19
eleven times or more     24     43     44     37     34   15
-------------------------------------------------

## Reading and Writing Data
We might have your data in .csv files or SQL tables. Maybe Excel files. Or .json files. The goal is the same in all cases. If we want to analyze that data using Pandas, the first step will be to read it into a data structure that’s compatible with Pandas, i.e. a ``Series`` or ``DataFrame``. Once we have completed some analysis work we might want to write the result out into a file too. In this section, we will look at how to read/write data using two of the most popular forms of data file that we are likely to encounter - CSV and JSON. However, Pandas is capable of reading HTML, Excel, SPSS, SQL and many more. Some of these will require additional libraries to be installed (see https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html for more details)

### CSV Files
A comma-separated values (CSV) file is a plaintext file with a .csv extension that holds tabular data. This is one of the most popular file formats for storing large amounts of data. Each row of the CSV file represents a single table row. The values in the same row are by default separated with commas, but we could change the separator to a semicolon, tab, space, or some other character

#### Reading a CSV File
Pandas provides the `read_csv()` function to read the contents of a .csv file into a ``DataFrame``. This function returns a new ``DataFrame`` with the data and labels stored in .csv file which we specify. This file specification can be any valid path, including URLs.

In [24]:
# reqd a .csv data file into memory and display the top 5 rows
presidents = pd.read_csv('data/president_heights.csv')
presidents.head()

   order               name  height(cm)
0      1  George Washington         189
1      2         John Adams         170
2      3   Thomas Jefferson         189
3      4      James Madison         163
4      5       James Monroe         183

#### Writing a CSV File
Pandas provides the `to_csv()` method to write the contents of a ``DataFrame`` to .csv file. This will create a file in the current working directory with the data and column names encoded in the DataFrame. In a DataFrame the first column always contains the row labels. We can prevent these being added to the file by adding the parameter `index=False`.

In [25]:
presidents.to_csv('presidents.csv', index=False)

### JSON Files
A JSON file is a file that stores simple data structures and objects in JavaScript Object Notation (JSON) format, which is a standard data interchange format. It is primarily used for transmitting data between a web application and a server. JSON files are lightweight, text-based, human-readable, and can be edited using a text editor.

#### Reading a JSON File
Pandas provides the `read_json()` function to read the contents of a .json file into a ``DataFrame``. This function returns a new ``DataFrame`` with the data and labels stored in .json file which we specify. This file specification can be any valid path, including URLs.

In [26]:
countries = pd.read_json('data/country_data.json')
countries

        COUNTRY      POP      AREA       GDP       CONT     IND_DAY
CHN       China  1398.72   9596.96  12234.78       Asia        None
IND       India  1351.16   3287.26   2575.67       Asia  1947-08-15
USA          US   329.74   9833.52  19485.39  N.America  1776-07-04
IDN   Indonesia   268.07   1910.93   1015.54       Asia  1945-08-17
BRA      Brazil   210.32   8515.77   2055.51  S.America  1822-09-07
PAK    Pakistan   205.71    881.91    302.14       Asia  1947-08-14
NGA     Nigeria   200.96    923.77    375.77     Africa  1960-10-01
BGD  Bangladesh   167.09    147.57    245.63       Asia  1971-03-26
RUS      Russia   146.79  17098.25   1530.75       None  1992-06-12
MEX      Mexico   126.58   1964.38   1158.23  N.America  1810-09-16
JPN       Japan   126.22    377.97   4872.42       Asia        None
DEU     Germany    83.02    357.11   3693.20     Europe        None
FRA      France    67.02    640.68   2582.49     Europe  1789-07-14
GBR          UK    66.44    242.50   2631.23     Europe        None
ITA       Italy    60.36    301.34   1943.84     Europe        None
ARG   Argentina    44.94   2780.40    637.49  S.America  1816-07-09
DZA     Algeria    43.38   2381.74    167.56     Africa  1962-07-05
CAN      Canada    37.59   9984.67   1647.12  N.America  1867-07-01
AUS   Australia    25.47   7692.02   1408.68    Oceania        None
KAZ  Kazakhstan    18.53   2724.90    159.41       Asia  1991-12-16

#### Writing a JSON File
Pandas provides the `to_json()` method to write the contents of a ``DataFrame`` to .json file. This will create a file in the current working directory with the data and column names encoded in the DataFrame.

In [27]:
countries.to_json('countries.json')

## Data Indexing and Selection

In Unit 6, we looked in detail at methods and tools to access, set, and modify values in NumPy arrays including indexing, slicing, masking, advanced indexing and concatenations. Here we'll look at similar means of accessing and modifying values in Pandas ``Series`` and ``DataFrame`` objects.

### Data Selection in Series
The following Series is used in this throughout this section.

In [28]:
data = pd.Series([0.25, 0.5, 0.75, 1.0],
                 index=['a', 'b', 'c', 'd'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

#### Series as one-dimensional array

A ``Series`` provides array-style item selection via the same basic mechanisms as NumPy arrays – that is, *slices* and *masking*.

In [29]:
# slicing by explicit index - final index is included in the slice
data['a':'c']

a    0.25
b    0.50
c    0.75
dtype: float64

In [30]:
# slicing by implicit integer index - final index is excluded from the slice
data[0:2]

a    0.25
b    0.50
dtype: float64

In [31]:
# masking
data[(data > 0.3) & (data < 0.8)]

b    0.50
c    0.75
dtype: float64

#### Series as dictionary

Like a dictionary, the ``Series`` object provides a mapping from a collection of keys to a collection of values:

In [32]:
data['b']

0.5

``Series`` objects can be modified with a dictionary-like syntax. Just as you can extend a dictionary by assigning to a new key, you can extend a ``Series`` by assigning to a new index value:

In [33]:
data['e'] = 1.25
data

a    0.25
b    0.50
c    0.75
d    1.00
e    1.25
dtype: float64

### Data Selection in DataFrame

Remember that a ``DataFrame`` can act like a dictionary of ``Series`` structures sharing the same index, and also like a two-dimensional array.

#### DataFrame as a dictionary

Firstly, consider the ``DataFrame`` as a dictionary of related ``Series`` objects.

In [34]:
area = pd.Series({'California': 423967, 'Texas': 695662,
                  'New York': 141297, 'Florida': 170312,
                  'Illinois': 149995})
pop = pd.Series({'California': 38332521, 'Texas': 26448193,
                 'New York': 19651127, 'Florida': 19552860,
                 'Illinois': 12882135})
data = pd.DataFrame({'area':area, 'pop':pop})
data

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

The individual ``Series`` that make up the columns of the ``DataFrame`` can be accessed via dictionary-style indexing of the column name:

In [35]:
data['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

Equivalently, we can use attribute-style access with column names that are strings.

In [36]:
data.area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

Like with the ``Series`` objects discussed earlier, this dictionary-style syntax can also be used to modify the object, in this case adding a new column:

In [37]:
data['density'] = data['pop'] / data['area']
data

              area       pop     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

To select only a subset of columns from a `DataFrame`, we can use a list of column names instead of a single column name. In this example, a list containing `area` and `density` are used as an index parameter to the `DataFrame`, i.e. `['area', 'density']`:

In [38]:
data[['area', 'density']]

              area     density
California  423967   90.413926
Texas       695662   38.018740
New York    141297  139.076746
Florida     170312  114.806121
Illinois    149995   85.883763

#### DataFrame as Two-dimensional Array
Secondly, consider the ``DataFrame`` as an enhanced two-dimensional array. We can examine the raw underlying data array using the ``values`` attribute:

In [39]:
data.values

array([[4.23967000e+05, 3.83325210e+07, 9.04139261e+01],
       [6.95662000e+05, 2.64481930e+07, 3.80187404e+01],
       [1.41297000e+05, 1.96511270e+07, 1.39076746e+02],
       [1.70312000e+05, 1.95528600e+07, 1.14806121e+02],
       [1.49995000e+05, 1.28821350e+07, 8.58837628e+01]])

When it comes to indexing of ``DataFrame`` objects, however, it is clear that the dictionary-style indexing of columns precludes our ability to simply treat it as a NumPy array.
In particular, passing a single index to an array accesses a row:

In [40]:
data.values[0]

array([4.23967000e+05, 3.83325210e+07, 9.04139261e+01])

and passing a single "index" to a ``DataFrame`` accesses a column:

In [41]:
data['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

### <font color='red'><u>Worksheet Exercises</u></font>
1. There is a file in the `data` folder called `california_cities.csv`. Read the contents of this file into a `DataFrame` called `cities`.
2. Each column in `cities` can be represented as a `Series` object. Select only the `elevation_m` column from `cities`.
3. Now, create a new `DataFrame` called `cities_metric` with the following columns from the original data: `city`, `elevation_m`, `area_land_km2`, `area_water_km2` and `pop_density`.
4. Add a new column to `cities_metric` which shows the population density (i.e. population per square kilometer)
5. Using masking, select only those cities in `cities_metric` whose elevation is greater than 1000m

In [42]:
import pandas as pd
  
# 1.
cities=pd.read_csv('data/california_cities.csv')

print("-------------------------------------------------")

# 2.
print(cities['elevation_m'])

print("-------------------------------------------------")

# 3. 
cities['pop_density'] = cities['population_total'] / cities['area_land_km2']
print(cities['pop_density'])

print("-------------------------------------------------")

# 4.
cities_metric=cities[['city','elevation_m','area_land_km2','area_water_km2', 'pop_density']]
print(cities_metric)

print("-------------------------------------------------")

# 5.
cities_metric[cities_metric['elevation_m'] > 1000]

-------------------------------------------------
0       875.0
1       281.0
2         NaN
3         NaN
4       150.0
        ...
477      30.0
478     787.0
479      18.0
480     798.0
481    1027.0
Name: elevation_m, Length: 482, dtype: float64
-------------------------------------------------
0       218.975335
1      1007.233452
2      2746.051961
3      4095.207254
4      4204.270607
          ...
477     739.536056
478     300.421712
479    1719.503152
480     711.148953
481     199.731761
Name: pop_density, Length: 482, dtype: float64
-------------------------------------------------
            city  elevation_m  area_land_km2  area_water_km2  pop_density
0       Adelanto        875.0        145.062           0.046   218.975335
1    AgouraHills        281.0         20.184           0.076  1007.233452
2        Alameda          NaN         27.482          31.983  2746.051961
3         Albany          NaN          4.632           9.524  4095.207254
4       Alhambra        150.0         19.763           0.003  4204.270607
..           ...          ...            ...             ...          ...
477   Yountville         30.0          3.966           0.000   739.536056
478        Yreka        787.0         25.847           0.188   300.421712
479     YubaCity         18.0         37.758           0.201  1719.503152
480      Yucaipa        798.0         72.231           0.013   711.148953
481  YuccaValley       1027.0        103.639           0.000   199.731761

[482 rows x 5 columns]
-------------------------------------------------

               city  elevation_m  area_land_km2  area_water_km2  pop_density
6           Alturas       1332.0          6.306           0.036   448.303203
39      BigBearLake       2058.0         16.435           0.488   305.384849
114          Dorris       1294.0          1.819           0.041   516.217702
242        Loyalton       1509.0          0.921           0.000   834.961998
246    MammothLakes       2402.0         64.402           1.139   127.853172
277     MountShasta       1099.0          9.754           0.010   347.959811
330         Portola       1480.0         14.003           0.000   150.253517
416  SouthLakeTahoe       1901.0         26.318          16.685   813.245687
424      Susanville       1276.0         20.541           0.222   875.030427
427       Tehachapi       1210.0         25.573           0.250   563.641340
436         Truckee       1773.0         83.713           3.449   193.279419
438        Tulelake       1230.0          1.061           0.006   951.932139
458            Weed       1044.0         12.405           0.012   239.177751
481     YuccaValley       1027.0        103.639           0.000   199.731761

## Handling Missing Data

The difference between data found in many tutorials and data in the real world is that real-world data is rarely clean and homogeneous. In particular, many interesting datasets will have some amount of data missing. To make matters even more complicated, different data sources may indicate missing data in different ways. In this section, we will discuss some general considerations for missing data, discuss how Pandas chooses to represent it, and demonstrate some built-in Pandas tools for handling missing data in Python. We refer to missing data in general as *null*, *NaN*, or *NA* values.

### Missing Data in Pandas

The way in which Pandas handles missing values is constrained by its reliance on the NumPy package, which does not have a built-in notion of NA values for non-floating-point data types. Pandas uses sentinels (special values that indicate something) for missing data based on two pre-existing Python null values: the special floating-point ``NaN`` value, and the Python ``None`` object.

#### ``None``: Pythonic missing data

The first sentinel value used by Pandas is ``None``, a Python object that is often used for missing data in Python code. Because it is a Python object, ``None`` cannot be used in any arbitrary NumPy/Pandas array, but only in arrays with data type ``'object'`` (i.e., arrays of Python objects):

In [43]:
import numpy as np
import pandas as pd

In [44]:
vals1 = np.array([1, None, 3, 4])
vals1

array([1, None, 3, 4], dtype=object)

This ``dtype=object`` means that the best common type representation NumPy could infer for the contents of the array is that they are Python objects. While this kind of object array is useful for some purposes, any operations on the data will be done at the Python level, with much more overhead than the typically fast operations seen for arrays with native types. The use of Python objects in an array also means that if you perform aggregations like ``sum()`` or ``min()`` across an array with a ``None`` value, you will generally get an error:

In [45]:
# vals1.sum()

TypeError: unsupported operand type(s) for +: 'int' and 'NoneType'

This reflects the fact that addition between an integer and ``None`` is undefined.

#### ``NaN``: Missing numerical data

The other missing data representation, ``NaN`` (acronym for *Not a Number*), is different; it is a special floating-point value recognized by all systems that use the standard IEEE floating-point representation:

In [46]:
vals2 = np.array([1, np.nan, 3, 4]) 
vals2.dtype

dtype('float64')

Notice that NumPy chose a native floating-point type for this array: this means that unlike the object array from before, this array supports fast operations pushed into compiled code. NOTE: regardless of the operation, the result of arithmetic with ``NaN`` will be another ``NaN`` - this means that aggregates over the values are well defined (i.e., they don't result in an error) but not always useful:

In [47]:
vals2.sum(), vals2.min(), vals2.max()

(nan, nan, nan)

NumPy does provide some special aggregations that will ignore these missing values:

In [48]:
np.nansum(vals2), np.nanmin(vals2), np.nanmax(vals2)

(8.0, 1.0, 4.0)

Keep in mind that ``NaN`` is specifically a floating-point value; there is no equivalent NaN value for integers, strings, or other types.

#### NaN and None in Pandas

``NaN`` and ``None`` both have their place, and Pandas is built to handle the two of them nearly interchangeably, converting between them where appropriate:

In [49]:
pd.Series([1, np.nan, 2, None])

0    1.0
1    NaN
2    2.0
3    NaN
dtype: float64

For types that don't have an available sentinel value, Pandas automatically type-casts when NA values are present.

### Operating on Null Values

As we have seen, Pandas treats ``None`` and ``NaN`` as essentially interchangeable for indicating missing or null values.
To facilitate this convention, there are several useful methods for detecting, removing, and replacing null values in Pandas data structures.
They are:

- ``isnull()``: Generate a boolean mask indicating missing values
- ``notnull()``: Opposite of ``isnull()``
- ``dropna()``: Return a filtered version of the data
- ``fillna()``: Return a copy of the data with missing values filled or imputed

#### Detecting null values
Pandas data structures have two useful methods for detecting null data: ``isnull()`` and ``notnull()``.
Either one will return a Boolean mask over the data. For example:

In [50]:
data = pd.Series([1, np.nan, 'hello', None])

In [51]:
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

Boolean masks can be used directly as a ``Series`` or ``DataFrame`` index:

In [52]:
data[data.notnull()]

0        1
2    hello
dtype: object

The ``isnull()`` and ``notnull()`` methods produce similar Boolean results for ``DataFrame``s.

#### Dropping null values

In addition to the masking used before, there are the convenience methods, ``dropna()``
(which removes NA values) and ``fillna()`` (which fills in NA values). For a ``Series``,
the result is straightforward:

In [ ]:
data.dropna()

For a ``DataFrame``, there are more options.
Consider the following ``DataFrame``:

In [ ]:
df = pd.DataFrame([[1,      np.nan, 2],
                   [2,      3,      5],
                   [np.nan, 4,      6]])
df

We cannot drop single values from a ``DataFrame``; we can only drop full rows or full columns.
Depending on the application, you might want one or the other, so ``dropna()`` gives a number of options for a ``DataFrame``. By default, ``dropna()`` will drop all rows in which *any* null value is present:

In [ ]:
df.dropna()

Alternatively, you can drop NA values along a different axis; ``axis='columns'`` drops all columns containing a null value:

In [ ]:
df.dropna(axis='columns')

#### Filling null values

Sometimes rather than dropping NA values, you'd rather replace them with a valid value.
This value might be a single number like zero, or it might be some sort of imputation or interpolation from the good values.
You could do this in-place using the ``isnull()`` method as a mask, but because it is such a common operation Pandas provides the ``fillna()`` method, which returns a copy of the array with the null values replaced.

Consider the following ``Series``:

In [ ]:
data = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))
data

We can fill NA entries with a single value, such as zero:

In [ ]:
data.fillna(0)

We can specify a forward-fill to propagate the previous value forward:

In [ ]:
# forward-fill
data.fillna(method='ffill')

Or we can specify a back-fill to propagate the next values backward:

In [ ]:
# back-fill
data.fillna(method='bfill')

For ``DataFrame``s, the options are similar, but we can also specify an ``axis`` along which the fills take place:

In [ ]:
df

In [ ]:
df.fillna(method='ffill', axis='columns')

Notice that if a previous value is not available during a forward fill, the NA value remains.

### <font color='red'><u>Worksheet Exercises</u></font>
1. The dataset (`california_cities.csv`) used throughout the last set of exercises includes some missing values. If this is not still in memory, read the contents of the file into a new `DataFrame` called `cities`.
2. The missing values in this dataset are indicated by `NaN`. Filter out any rows that contain this value.
3. Instead of filtering out rows with missing values, set the missing values to `0`

In [53]:
import pandas as pd
  
# 1.
cities=pd.read_csv('data/california_cities.csv')

# 2.
clean_cities=cities.dropna()
print(clean_cities['city'].head()) # note that rows 2 and 3 have been removed

# 3.
fixed_cities=cities.fillna(0)
fixed_cities.head() # note that elevation_m values for rows 2 and 3 are now 0.0 not NaN

0       Adelanto
1    AgouraHills
4       Alhambra
5     AlisoViejo
6        Alturas
Name: city, dtype: object

,city,latd,longd,elevation_m,elevation_ft,population_total,area_total_sq_mi,area_land_sq_mi,area_water_sq_mi,area_total_km2,area_land_km2,area_water_km2,area_water_percent
0,Adelanto,34.576111,-117.432778,875.0,2871.0,31765,56.027,56.009,0.018,145.107,145.062,0.046,0.03
1,AgouraHills,34.153333,-118.761667,281.0,922.0,20330,7.822,7.793,0.029,20.260,20.184,0.076,0.37
2,Alameda,37.756111,-122.274444,0.0,33.0,75467,22.960,10.611,12.349,59.465,27.482,31.983,53.79
3,Albany,37.886944,-122.297778,0.0,43.0,18969,5.465,1.788,3.677,14.155,4.632,9.524,67.28
4,Alhambra,34.081944,-118.135000,150.0,492.0,83089,7.632,7.631,0.001,19.766,19.763,0.003,0.01

## Combining Datasets: Concat and Append

Some of the most interesting studies of data come from combining different data sources. These operations can involve anything from very straightforward concatenation of two different datasets, to more complicated database-style joins and merges that correctly handle any overlaps between the datasets. ``Series`` and ``DataFrame``s are built with this type of operation in mind, and Pandas includes functions and methods that make this sort of data wrangling fast and straightforward.

It will be useful for the next section to be able to show multiple dataframes at the same time. Here, we create a quick class that allows us to display multiple ``DataFrame``s side by side. An explanation of this programming construct is beyond the scope of this Jupyter Notebook (and the module). However, if you want to find out more about creating classes in Python see https://docs.python.org/3/tutorial/classes.html for more information.

In [ ]:
import pandas as pd

class display(object):
    """Display HTML representation of multiple objects"""
    template = """<div style="float: left; padding: 10px;">
    <p style='font-family:"Courier New", Courier, monospace'>{0}</p>{1}
    </div>"""
    def __init__(self, *args):
        self.args = args
        
    def _repr_html_(self):
        return '\n'.join(self.template.format(a, eval(a)._repr_html_())
                         for a in self.args)
    
    def __repr__(self):
        return '\n\n'.join(a + '\n' + repr(eval(a))
                           for a in self.args)

### Simple Concatenation with ``concat()``

Pandas has a function, ``concat()``, which has a similar syntax to NumPy's ``concatenate()`` function. ``concat()`` can be used for a simple concatenation of ``Series`` or ``DataFrame`` objects:

In [54]:
ser1 = pd.Series(['A', 'B', 'C'], index=[1, 2, 3])
ser2 = pd.Series(['D', 'E', 'F'], index=[4, 5, 6])
pd.concat([ser1, ser2])

1    A
2    B
3    C
4    D
5    E
6    F
dtype: object

It also works to concatenate higher-dimensional objects, such as ``DataFrame``s:

In [57]:
df1 = pd.DataFrame([['A1','B1'],['A2','B2']],columns=['A', 'B'],index=[1, 2])
df2 = pd.DataFrame([['A3','B3'],['A4','B4']],columns=['A', 'B'],index=[3, 4])

# here we are using the class we created above to show these data frames side by side
display('df1', 'df2', pd.concat([df1, df2]))

'df1'

'df2'

    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

By default, the concatenation takes place row-wise within the ``DataFrame`` (i.e., ``axis='rows'``). ``concat()`` also allows specification of an axis along which concatenation will take place. The following example uses columns (``axis="columns"``) to concatenate the data:

In [58]:
df3 = pd.DataFrame([['A0','B0'],['A1','B1']],columns=['A', 'B'],index=[0, 1])
df4 = pd.DataFrame([['C0','D0'],['C1','D1']],columns=['C', 'D'],index=[0, 1])

display('df3', 'df4', pd.concat([df3, df4], axis="columns"))

'df3'

'df4'

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1

#### Concatenation with joins

So far, we have concatenated ``DataFrame``s with shared column names. In practice, data from different sources might have different sets of column names, and ``concat()`` offers several options in this case. Consider the concatenation of the following two ``DataFrame``s, which have some (but not all!) columns in common:

In [59]:
df5 = pd.DataFrame([['A1','B1','C1'],['A2','B2','C2']],columns=['A', 'B', 'C'],index=[1, 2])
df6 = pd.DataFrame([['B3','C3','D3'],['B4','C4','D4']],columns=['B', 'C', 'D'],index=[3, 4])

display('df5', 'df6', pd.concat([df5, df6]))

'df5'

'df6'

     A   B   C    D
1   A1  B1  C1  NaN
2   A2  B2  C2  NaN
3  NaN  B3  C3   D3
4  NaN  B4  C4   D4

By default, the entries for which no data is available are filled with NA values. To change this, we can specify one of several options for the ``join`` parameter of the concatenate function. By default, the join is a union of the input columns (``join='outer'``), but we can change this to an intersection of the columns using ``join='inner'``:

In [60]:
display('df5', 'df6', pd.concat([df5, df6],join="inner"))

'df5'

'df6'

    B   C
1  B1  C1
2  B2  C2
3  B3  C3
4  B4  C4

### The ``append()`` method

Because direct array concatenation is so common, ``Series`` and ``DataFrame`` objects have an ``append()`` method that can accomplish the same thing in fewer keystrokes.
For example, rather than calling ``pd.concat([df1, df2])``, you can simply call ``df1.append(df2)``:

In [62]:
display('df1', 'df2', df1.append(df2))

C:\Users\h22-liu\AppData\Local\Temp\ipykernel_30576\1702716809.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  display('df1', 'df2', df1.append(df2))

'df1'

'df2'

    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

### <font color='red'><u>Worksheet Exercises</u></font>
1. In the first set of worksheet exercises, two `DataFrames` were created to record the percentage frequency of online purchases in 2020 for different age groups and gender. Combine these DataFrames to form a more complete picture of online purchases.

In [63]:
import pandas as pd
  
# 1.
combined_purchase = pd.concat([gender_purchase,age_group_purchase], axis='columns')
print(combined_purchase)

                      male  female  16-24  25-34  35-44  45-54  55-64  65+
once or twice           18      15     25     11     12      9     19   26
three to five times     28      32     30     26     23     36     25   39
six to ten times        20      18     20     18     20     17     22   19
eleven times or more    34      34     24     43     44     37     34   15

## Combining Datasets: Merge and Join

One essential feature offered by Pandas is its high-performance, in-memory join and merge operations. If you have ever worked with databases, you should be familiar with this type of data interaction. The main interface for this is the ``merge()`` function. The behavior implemented in ``merge()`` is a subset of what is known as *relational algebra*, which is a formal set of rules for manipulating relational data, and forms the conceptual foundation of operations available in most databases. Pandas implements several of the fundamental relational algebra primitive operations in the ``merge()`` function and the related ``join()`` method of ``Series`` and ``Dataframe``s.

### Categories of Joins

The ``merge()`` function implements a number of types of joins: the *one-to-one*, *many-to-one*, and *many-to-many* joins.
All three types of joins are accessed via an identical call to the ``merge()`` interface; the type of join performed depends on the form of the input data.

#### One-to-one joins

The simplest type of merge expresion is the one-to-one join. It is very similar to the column-wise concatenation seen above. As a concrete example, consider the following two ``DataFrames`` which contain information on several employees in a company. To combine this information into a single ``DataFrame``, we can use the ``merge()`` function.

In [64]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'hire_date': [2004, 2008, 2012, 2014]})
df3 = pd.merge(df1, df2)

display('df1', 'df2', pd.merge(df1, df2))

'df1'

'df2'

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

The ``merge()`` function recognizes that each ``DataFrame`` has an `employee` column, and automatically joins using this column as a key. The result of the merge is a new ``DataFrame`` that combines the information from the two inputs.

#### Many-to-one joins

Many-to-one joins are joins in which one of the two key columns contains duplicate entries.
For the many-to-one case, the resulting ``DataFrame`` will preserve those duplicate entries as appropriate.
Consider the following example of a many-to-one join:

In [65]:
df4 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'],
                    'supervisor': ['Carly', 'Guido', 'Steve']})

display('df3', 'df4', pd.merge(df3, df4))

'df3'

'df4'

  employee        group  hire_date supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Engineering       2012      Guido
2     Lisa  Engineering       2004      Guido
3      Sue           HR       2014      Steve

The resulting ``DataFrame`` has an aditional column with the `supervisor` information, where the information is repeated in one or more locations as required by the inputs (e.g. `Guido` appears twice in row 1 and 2 because both `Jake` and `Lisa` are in the `Engineering` group).

#### Many-to-many joins

Many-to-many joins are a bit confusing conceptually, but are nevertheless well defined. If the key column in both the left and right `DataFrame` contains duplicates, then the result is a many-to-many merge. This will be perhaps most clear with a concrete example. Consider the following, where we have a ``DataFrame`` showing one or more skills associated with a particular group.
By performing a many-to-many join, we can recover the skills associated with any individual person:

In [66]:
df5 = pd.DataFrame({'group': ['Accounting', 'Accounting',
                              'Engineering', 'Engineering', 'HR', 'HR'],
                    'skills': ['math', 'spreadsheets', 'coding', 'linux',
                               'spreadsheets', 'organization']})

display('df1', 'df5', pd.merge(df1, df5))

'df1'

'df5'

  employee        group        skills
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2     Jake  Engineering        coding
3     Jake  Engineering         linux
4     Lisa  Engineering        coding
5     Lisa  Engineering         linux
6      Sue           HR  spreadsheets
7      Sue           HR  organization

### Specifying the Merge Key

We've already seen the default behavior of ``merge()``: it looks for one or more matching column names between the two inputs, and uses this as the key. However, often the column names will not match so nicely, and ``merge()`` provides a variety of options for handling this.

#### The ``on`` keyword

Most simply, you can explicitly specify the name of the key column using the ``on`` keyword, which takes a column name or a list of column names:

In [67]:
display('df1', 'df2', pd.merge(df1, df2, on='employee'))

'df1'

'df2'

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

This option works only if <u>both</u> the left and right ``DataFrame``s have the specified column name.

#### The ``left_on`` and ``right_on`` keywords

At times you may wish to merge two datasets with different column names; for example, we may have a dataset in which the employee name is labeled as `name` rather than `employee`. In this case, we can use the ``left_on`` and ``right_on`` keywords to specify the two column names:

In [ ]:
df3 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'salary': [70000, 80000, 120000, 90000]})

display('df1', 'df3', 'pd.merge(df1, df3, left_on="employee", right_on="name")')

The result has a redundant column that we can drop if desired–for example, by using the ``drop()`` method of ``DataFrame``s:

In [ ]:
pd.merge(df1, df3, left_on="employee", right_on="name").drop('name', axis='columns')

### Specifying Set Arithmetic for Joins

In all the preceding examples we have glossed over one important consideration in performing a join: the type of set arithmetic used in the join.
This comes up when a value appears in one key column but not the other. Consider this example:

In [ ]:
df6 = pd.DataFrame({'name': ['Peter', 'Paul', 'Mary'],
                    'food': ['fish', 'beans', 'bread']},
                   columns=['name', 'food'])
df7 = pd.DataFrame({'name': ['Mary', 'Joseph'],
                    'drink': ['wine', 'beer']},
                   columns=['name', 'drink'])

display('df6', 'df7', 'pd.merge(df6, df7)')

Here we have merged two datasets that have only a single `name` entry in common: Mary. By default, the result contains the *intersection* of the two sets of inputs; this is what is known as an *inner join*. We can specify this explicitly using the ``how`` keyword, which defaults to ``'inner'``:

In [ ]:
pd.merge(df6, df7, how='inner')

Other options for the ``how`` keyword are ``'outer'``, ``'left'``, and ``'right'``.

#### `outer` join
An *outer join* returns a join over the union of the input columns, and fills in all missing values with NAs:

In [ ]:
display('df6', 'df7', "pd.merge(df6, df7, how='outer')")

#### `left` join
The *left join* and *right join* return joins over the left entries and right entries, respectively.
For example:

In [ ]:
display('df6', 'df7', "pd.merge(df6, df7, how='left')")

The output rows now correspond to the entries in the left input. 

#### `right` join
The *right join* return joins over the right entries. For example:

In [ ]:
display('df6', 'df7', "pd.merge(df6, df7, how='right')")

### <font color='red'><u>Worksheet Exercises</u></font>
There are three datasets in the `data` folder: `state-abbrevs.csv`, `state-areas.csv` and `state-populations.csv`.
1. Use the `merge()` function, combine the `state-abbrevs.csv` and `state-areas.csv` datasets into a single `DataFrame` called `states`.
2. Now, combine `states` with the dataset `state-populations.csv`. Use the same `DataFrame` name for the result, i.e. `states`.
3. Now, drop the `state/region` duplicate column from `states` using `drop()`

In [ ]:
import pandas as pd
  
# 1.
state_abbrevs = pd.read_csv('data/state-abbrevs.csv')
state_areas = pd.read_csv('data/state-areas.csv')
states = pd.merge(state_areas,state_abbrevs)

# 2.
state_population = pd.read_csv('data/state-population.csv')
states = pd.merge(states,state_population, left_on='abbreviation', right_on='state/region')

# 3.
states = states.drop(['state/region'], axis='columns')
states

## Aggregation and Grouping

An essential piece of analysis of large data is efficient summarization: computing aggregations like ``sum()``, ``mean()``, ``median()``, ``min()``, and ``max()``, in which a single number gives insight into the nature of a potentially large dataset.
In this section, we'll explore aggregations in Pandas, from simple operations akin to what we've seen on NumPy arrays, to more sophisticated operations based on the concept of a ``groupby``.

### Planets Data

Throughout this section, we will use a Planets dataset to provide a realistic set of data to aggregate. The dataset gives information on planets that astronomers have discovered around other stars (known as *extrasolar planets* or *exoplanets* for short). It includes some details on the 1,000+ extrasolar planets discovered up to 2014. We can use Pandas `read_csv()` function to read the CSV data into a ``DataFrame``.

In [ ]:
import pandas as pd
planets = pd.read_csv('data\planets.csv')

planets.head()

### Simple Aggregation in Pandas

In Unit 6, we explored some of the data aggregations available for NumPy arrays. As with a one-dimensional NumPy array, for a Pandas ``Series``, the aggregates return a single value:

In [ ]:
import numpy as np

rng = np.random.RandomState(42)
ser = pd.Series(rng.rand(5))

print(ser.sum())
print(ser.mean())

For a ``DataFrame``, by default the aggregates return results within each column:

In [ ]:
df = pd.DataFrame({'A': rng.rand(5),
                   'B': rng.rand(5)})
df

In [ ]:
df.mean()

By specifying the ``axis`` argument, you can instead aggregate within each row:

In [ ]:
df.mean(axis='columns')

Pandas ``Series`` and ``DataFrame``s include all of the common aggregates available to NumPy; in addition, there is a convenience method ``describe()`` that computes several common aggregates for each column and returns the result. (NOTE: essentially, this is what you are doing in the Programming Task 1 of the assignment). For the Planets data, we will drop any rows with missing values before we use the `describe()` method:

In [ ]:
planets.dropna().describe()

The following table summarizes some other built-in Pandas aggregations (applicable to both ``DataFrame`` and ``Series`` objects):

| Aggregation              | Description                     |
|--------------------------|---------------------------------|
| ``count()``              | Total number of items           |
| ``first()``, ``last()``  | First and last item             |
| ``mean()``, ``median()`` | Mean and median                 |
| ``min()``, ``max()``     | Minimum and maximum             |
| ``std()``, ``var()``     | Standard deviation and variance |
| ``mad()``                | Mean absolute deviation         |
| ``prod()``               | Product of all items            |
| ``sum()``                | Sum of all items                |

To go deeper into the data, however, simple aggregates are often not enough.
The next level of data summarization is the ``groupby`` operation, which allows you to quickly and efficiently compute aggregates on subsets of data.

### GroupBy: Split, Apply, Combine

Simple aggregations can give us a flavor of a dataset, but often we would prefer to aggregate conditionally on some label or index: this is implemented in the ``groupby`` operation. The name "group by" comes from a command in the SQL database language. Consider the ``groupby`` operation as a three step process: split, apply and combine:

- The *split* step involves breaking up and grouping a ``DataFrame`` depending on the value of the specified key.
- The *apply* step involves computing some function, usually an aggregate, transformation, or filtering, within the individual groups.
- The *combine* step merges the results of these operations into an output array.

![](figures/split-apply-combine.png)

#### A simple example
As a simple example of the ``groupby`` operation, let's take a look at using Pandas to perform the computation shown in the diagram above. We'll start by creating the input ``DataFrame``:

In [ ]:
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'data': range(6)}, columns=['key', 'data'])
df

The most basic split-apply-combine operation can be computed by passing the name of the desired key column:

In [ ]:
df.groupby('key')

Notice that what is returned is not a set of ``DataFrame``s, but a ``DataFrameGroupBy`` object. To produce a result, we can apply an aggregate to this ``DataFrameGroupBy`` object, which will perform the appropriate apply/combine steps to produce the desired result:

In [ ]:
df.groupby('key').sum()

The ``sum()`` method is just one possibility here; you can apply virtually any common Pandas or NumPy aggregation function, as well as virtually any valid ``DataFrame`` operation.

### <font color='red'><u>Worksheet Exercises</u></font>
For this exercise the `DataFrame` resulting from the previous set of exercises is required, i.e. `states`.
1. Using the `groupby()` and `sum()` functions, find the sums of each numeric column for each state
2. This output is not very informative. The dataset provides populations for the years between 1990 and 2013 in each state. Using another `groupby()` function, find the total population of the USA in each of these years

In [ ]:
import pandas as pd

# 1.
print(states.groupby('state').sum())

# 2.
year_population = states[['year','population']]
print(year_population.groupby(['year']).sum())

## Vectorized String Operations

One strength of Python is its relative ease in handling and manipulating string data. Pandas builds on this and provides a comprehensive set of *vectorized string operations* that become an essential piece of the type of munging required when cleaning up real-world data.

### Pandas String Operations
Pandas includes features to address both this need for vectorized string operations and for correctly handling missing data via the ``str`` attribute of Pandas ``Series`` and ``Index`` objects that contain strings. So, for example, we can call a single method that will capitalize all the entries, while skipping over any missing values:

In [ ]:
names = pd.Series(['peter', 'Paul', None, 'MARY', 'gUIDO'])
names.str.capitalize()

### Tables of Pandas String Methods
Nearly all Python's built-in string methods are mirrored by a Pandas vectorized string method. Here is a list of Pandas ``str`` methods that mirror Python string methods:

|             |                  |                  |                  |
|-------------|------------------|------------------|------------------|
|``len()``    | ``lower()``      | ``translate()``  | ``islower()``    | 
|``ljust()``  | ``upper()``      | ``startswith()`` | ``isupper()``    | 
|``rjust()``  | ``find()``       | ``endswith()``   | ``isnumeric()``  | 
|``center()`` | ``rfind()``      | ``isalnum()``    | ``isdecimal()``  | 
|``zfill()``  | ``index()``      | ``isalpha()``    | ``split()``      | 
|``strip()``  | ``rindex()``     | ``isdigit()``    | ``rsplit()``     | 
|``rstrip()`` | ``capitalize()`` | ``isspace()``    | ``partition()``  | 
|``lstrip()`` |  ``swapcase()``  |  ``istitle()``   | ``rpartition()`` |

Here are some examples of these methods in action:

In [ ]:
monte = pd.Series(['Graham Chapman', 'John Cleese', 'Terry Gilliam',
                   'Eric Idle', 'Terry Jones', 'Michael Palin'])
monte.str.lower()

To find the length of the strings:

In [ ]:
monte.str.len()

Or to find which string begin with a `T`.

In [ ]:
monte.str.startswith('T')

Or even to split the strings into separate words and return these as a ``Series`` of lists:

In [ ]:
monte.str.split()

#### Methods using regular expressions

In addition, there are several methods that accept regular expressions to examine the content of each string element, and follow some of the API conventions of Python's built-in ``re`` module (see https://docs.python.org/3/library/re.html for more information) :

| Method | Description |
|--------|-------------|
| ``match()`` | Call ``re.match()`` on each element, returning a boolean. |
| ``extract()`` | Call ``re.match()`` on each element, returning matched groups as strings.|
| ``findall()`` | Call ``re.findall()`` on each element |
| ``replace()`` | Replace occurrences of pattern with some other string|
| ``contains()`` | Call ``re.search()`` on each element, returning a boolean |
| ``count()`` | Count occurrences of pattern|
| ``split()``   | Equivalent to ``str.split()``, but accepts regexps |
| ``rsplit()`` | Equivalent to ``str.rsplit()``, but accepts regexps |

With these, you can do a wide range of interesting operations.
For example, we can extract the first name from each by asking for a contiguous group of characters at the beginning of each element:

In [ ]:
monte.str.extract('([A-Za-z]+)', expand=False)

Or we can do something more complicated, like finding all names that start and end with a consonant, making use of the start-of-string (``^``) and end-of-string (``$``) regular expression characters:

In [ ]:
monte.str.findall(r'^[^AEIOU].*[^aeiou]$')

The ability to concisely apply regular expressions across ``Series`` or ``Dataframe`` entries opens up many possibilities for analysis and cleaning of data.

#### Miscellaneous methods
Finally, there are some miscellaneous methods that enable other convenient operations:

| Method | Description |
|--------|-------------|
| ``get()`` | Index each element |
| ``slice()`` | Slice each element|
| ``slice_replace()`` | Replace slice in each element with passed value|
| ``cat()``      | Concatenate strings|
| ``repeat()`` | Repeat values |
| ``normalize()`` | Return Unicode form of string |
| ``pad()`` | Add whitespace to left, right, or both sides of strings|
| ``wrap()`` | Split long strings into lines with length less than a given width|
| ``join()`` | Join strings in each element of the Series with passed separator|
| ``get_dummies()`` | extract dummy variables as a dataframe |

## Working with Time Series

Pandas was developed in the context of financial modeling, so as you might expect, it contains a fairly extensive set of tools for working with dates, times, and time-indexed data.

### Dates and Times in Python

The Python world has a number of available representations of dates, times, deltas, and timespans.
While the time series tools provided by Pandas tend to be the most useful for data science applications, it is helpful to see their relationship to other packages used in Python.

#### Native Python dates and times: ``datetime`` and ``dateutil``

Python's basic objects for working with dates and times reside in the built-in ``datetime`` module.
Along with the third-party ``dateutil`` module, you can use it to quickly perform a host of useful functionalities on dates and times.
For example, you can manually build a date using the ``datetime`` type:

In [ ]:
from datetime import datetime
datetime(year=2015, month=7, day=4)

Or, using the ``dateutil`` module, you can parse dates from a variety of string formats:

In [ ]:
from dateutil import parser
date = parser.parse("4th of July, 2015")
date

The power of ``datetime`` and ``dateutil`` lie in their flexibility and easy syntax: you can use these objects and their built-in methods to easily perform nearly any operation you might be interested in. Where they break down is when you wish to work with large arrays of dates and times.

#### Typed arrays of times: NumPy's ``datetime64``

The weaknesses of Python's datetime format inspired the NumPy team to add a set of native time series data type to NumPy.
The ``datetime64`` dtype encodes dates as 64-bit integers, and thus allows arrays of dates to be represented very compactly.
The ``datetime64`` requires a very specific input format:

In [ ]:
import numpy as np
date = np.array('2015-07-04', dtype=np.datetime64)
date

Once we have this date formatted, however, we can quickly do vectorized operations on it:

In [ ]:
date + np.arange(12)

Because of the uniform type in NumPy ``datetime64`` arrays, this type of operation can be accomplished much more quickly than if we were working directly with Python's ``datetime`` objects, especially as arrays get large. One detail of the ``datetime64`` and ``timedelta64`` objects is that they are built on a *fundamental time unit*. Because the ``datetime64`` object is limited to 64-bit precision, the range of encodable times is $2^{64}$ times this fundamental unit. In other words, ``datetime64`` imposes a trade-off between *time resolution* and *maximum time span*.

The following table lists all of the available fundamental time unit format codes (see https://numpy.org/doc/stable/reference/arrays.datetime.html for more information) :

|Code    | Meaning     | 
|--------|-------------|
| ``Y``  | Year	       |
| ``M``  | Month       |
| ``W``  | Week	       |
| ``D``  | Day         |
| ``h``  | Hour        |
| ``m``  | Minute      |
| ``s``  | Second      |
| ``ms`` | Millisecond |
| ``us`` | Microsecond |
| ``ns`` | Nanosecond  |
| ``ps`` | Picosecond  |
| ``fs`` | Femtosecond |
| ``as`` | Attosecond  |

### Dates and times in Pandas: best of both worlds

Pandas provides a ``Timestamp`` object, which combines the ease-of-use of ``datetime`` and ``dateutil`` with the efficient storage and vectorized interface of ``numpy.datetime64``. From a group of these ``Timestamp`` objects, Pandas can construct a ``DatetimeIndex`` that can be used to index data in a ``Series`` or ``DataFrame``.

#### Pandas Time Series: Indexing by Time

Where the Pandas time series tools really become useful is when you begin to *index data by timestamps*.
For example, we can construct a ``Series`` object that has time indexed data:

In [ ]:
index = pd.DatetimeIndex(['2014-07-04', '2014-08-04',
                          '2015-07-04', '2015-08-04'])
data = pd.Series([0, 1, 2, 3], index=index)
data

Now that we have this data in a ``Series``, we can make use of any of the ``Series`` indexing patterns we discussed in previous sections, passing values that can be coerced into dates:

In [ ]:
data['2014-07-04':'2015-07-04']

There are additional special date-only indexing operations, such as passing a year to obtain a slice of all data from that year:

In [ ]:
data['2015']